In [30]:
import pandas as pd #pd=shortcut

FNAME = "http://www.stat.ucla.edu/~rgould/datasets/twins.dat" #assigned link to object FNAME

# ? for missing value with na_values
df= pd.read_csv(FNAME, sep='\t', na_values="?") 
df.head() #look at first rows

#CTRL + enter =execute one cell
#SHIFT + enter = execute and add a new cell

,DLHRWAGE,DEDUC1,AGE,AGESQ,LHRWAGEH,WHITEH,MALEH,EDUCH,LHRWAGEL,WHITEL,MALEL,EDUCL,DEDUC2,DTEN,DMARRIED,DUNCOV
0,0.259347,0,33.251198,1105.642156,2.420368,1,0,16,2.161022,1,0,16,0,1.333,0,0.0
1,NaN,-1,54.053388,2921.768764,NaN,1,0,9,2.060514,1,0,10,1,8.000,1,0.0
2,0.721318,7,43.570157,1898.358618,2.890372,1,0,19,2.169054,1,0,12,4,3.000,-1,0.0
3,0.011582,0,30.967830,959.006511,2.803360,1,1,12,2.791778,1,1,12,0,-2.000,0,1.0
4,-0.560985,0,34.633812,1199.500965,2.263366,1,1,14,2.824351,1,1,14,1,2.917,0,-1.0

In [11]:
df.shape #attribute because no parenthesis

(183, 16)

In [12]:
df.describe()

,DEDUC1,AGE,AGESQ,WHITEH,MALEH,EDUCH,WHITEL,MALEL,EDUCL,DEDUC2,DMARRIED,DUNCOV
count,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,182.000000
mean,-0.010929,38.694015,1666.242009,0.934426,0.459016,13.950820,0.939891,0.530055,13.890710,-0.021858,-0.010929,0.021978
std,1.881048,13.036251,1181.710178,0.248215,0.499685,2.332943,0.238341,1.118242,2.403996,1.886785,0.502620,0.492553
min,-7.000000,18.781656,352.750617,0.000000,0.000000,8.000000,0.000000,0.000000,1.000000,-6.000000,-1.000000,-1.000000
25%,-1.000000,28.977413,839.696325,1.000000,0.000000,12.000000,1.000000,0.000000,12.000000,-1.000000,0.000000,0.000000
50%,0.000000,36.041068,1298.958565,1.000000,0.000000,13.000000,1.000000,0.000000,14.000000,0.000000,0.000000,0.000000
75%,0.000000,44.777550,2005.034018,1.000000,1.000000,16.000000,1.000000,1.000000,16.000000,0.000000,0.000000,0.000000
max,7.000000,79.123888,6260.589612,1.000000,1.000000,20.000000,1.000000,14.000000,20.000000,7.000000,1.000000,1.000000

In [ ]:
#Changing dtypes

In [14]:
df.dtypes #data types

DLHRWAGE     object
DEDUC1        int64
AGE         float64
AGESQ       float64
LHRWAGEH     object
WHITEH        int64
MALEH         int64
EDUCH         int64
LHRWAGEL     object
WHITEL        int64
MALEL         int64
EDUCL         int64
DEDUC2        int64
DTEN         object
DMARRIED      int64
DUNCOV      float64
dtype: object

In [20]:
df["WHITEH"] = df["WHITEH"].astype(bool) #option 1

In [21]:
df.dtypes

DLHRWAGE     object
DEDUC1        int64
AGE         float64
AGESQ       float64
LHRWAGEH     object
WHITEH         bool
MALEH         int64
EDUCH         int64
LHRWAGEL     object
WHITEL        int64
MALEL         int64
EDUCL         int64
DEDUC2        int64
DTEN         object
DMARRIED      int64
DUNCOV      float64
dtype: object

In [28]:
# df["LHRWAGEH"] = df["LHRWAGEH"].astype(float) #option 2
pd.to_numeric(df["LHRWAGEH"], errors="coerce") #option 3, state the error to coerce ->NaN (Not a number)
df.dtypes

DLHRWAGE     object
DEDUC1        int64
AGE         float64
AGESQ       float64
LHRWAGEH     object
WHITEH         bool
MALEH         int64
EDUCH         int64
LHRWAGEL     object
WHITEL        int64
MALEL         int64
EDUCL         int64
DEDUC2        int64
DTEN         object
DMARRIED      int64
DUNCOV      float64
dtype: object

In [34]:
#We can give a dictionary of columns to interpret as something
# Its possible to look at memory usage, and changeing to boolean could save space, for example
df.info(memory_usage=True) #to know ehich memory is consuming

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 183 entries, 0 to 182
Data columns (total 16 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DLHRWAGE  149 non-null    float64
 1   DEDUC1    183 non-null    int64
 2   AGE       183 non-null    float64
 3   AGESQ     183 non-null    float64
 4   LHRWAGEH  161 non-null    float64
 5   WHITEH    183 non-null    int64
 6   MALEH     183 non-null    int64
 7   EDUCH     183 non-null    int64
 8   LHRWAGEL  162 non-null    float64
 9   WHITEL    183 non-null    int64
 10  MALEL     183 non-null    int64
 11  EDUCL     183 non-null    int64
 12  DEDUC2    183 non-null    int64
 13  DTEN      179 non-null    float64
 14  DMARRIED  183 non-null    int64
 15  DUNCOV    182 non-null    float64
dtypes: float64(7), int64(9)
memory usage: 23.0 KB

In [36]:
##Slicing and Indexing
df.iloc[0] # First row

DLHRWAGE       0.259347
DEDUC1         0.000000
AGE           33.251198
AGESQ       1105.642156
LHRWAGEH       2.420368
WHITEH         1.000000
MALEH          0.000000
EDUCH         16.000000
LHRWAGEL       2.161022
WHITEL         1.000000
MALEL          0.000000
EDUCL         16.000000
DEDUC2         0.000000
DTEN           1.333000
DMARRIED       0.000000
DUNCOV         0.000000
Name: 0, dtype: float64

In [38]:
#using the name of the row (E.g. companies)
df.loc[0] #no i here

DLHRWAGE       0.259347
DEDUC1         0.000000
AGE           33.251198
AGESQ       1105.642156
LHRWAGEH       2.420368
WHITEH         1.000000
MALEH          0.000000
EDUCH         16.000000
LHRWAGEL       2.161022
WHITEL         1.000000
MALEL          0.000000
EDUCL         16.000000
DEDUC2         0.000000
DTEN           1.333000
DMARRIED       0.000000
DUNCOV         0.000000
Name: 0, dtype: float64

In [40]:
#Access a range
df.iloc[9:11]

,DLHRWAGE,DEDUC1,AGE,AGESQ,LHRWAGEH,WHITEH,MALEH,EDUCH,LHRWAGEL,WHITEL,MALEL,EDUCL,DEDUC2,DTEN,DMARRIED,DUNCOV
9,-0.470004,0,47.605749,2266.307384,1.832581,1,0,12,2.302585,1,0,12,0,-5.0,0,0.0
10,0.051751,-1,51.901437,2693.759201,2.847812,1,1,12,2.796061,1,1,13,-2,9.0,0,0.0

In [43]:
#Same for columns
df["AGE"]

0      33.251198
1      54.053388
2      43.570157
3      30.967830
4      34.633812
         ...
178    45.555099
179    26.376454
180    40.312115
181    28.413415
182    28.413415
Name: AGE, Length: 183, dtype: float64

In [45]:
#Combine: Range and number of column
df.iloc[9:11,2]

9     47.605749
10    51.901437
Name: AGE, dtype: float64

In [46]:
df.loc[0,"AGE"]=20

In [48]:
df.loc[0,"AGE"]

20.0

In [58]:
#Mask: only positive values when true
#intereste in each observation when it is white. Using == for comparisson
mask = (df["WHITEH"] <=60) & (df["MALEL"] == 1) &(df["EDUCH"].isin((12,14))) ## for unequal =!, >= at least
df[mask]
#["AGE"].mean()
#all observations where they are at most 60,twin is male, educh between 12,14, only whowing age and average

41.362354552250004

In [62]:
#How many observations have WHITEL equal to 0?
mask2= (df["WHITEL"])==0
df[mask2].shape

(11, 16)

In [72]:
mask3= (df["WHITEL"]) ==1 & (df["DEDUC1"])=!0 
df[mask3].shape

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (1358310275.py, line 1)

In [73]:
#df[df["WHITEH"]!= df["WHITEL"]
sum(df["WHITEH"] != df["WHITEL"]

SyntaxError: incomplete input (1974052710.py, line 2)

In [75]:
#Help on function
help(pd.to_numeric)
#default values, in this case errors='raise'

Help on function to_numeric in module pandas.core.tools.numeric:

to_numeric(arg, errors='raise', downcast=None)
    Convert argument to a numeric type.

    The default return dtype is `float64` or `int64`
    depending on the data supplied. Use the `downcast` parameter
    to obtain other dtypes.

    Please note that precision loss may occur if really large numbers
    are passed in. Due to the internal limitations of `ndarray`, if
    numbers smaller than `-9223372036854775808` (np.iinfo(np.int64).min)
    or larger than `18446744073709551615` (np.iinfo(np.uint64).max) are
    passed in, it is very likely they will be converted to float so that
    they can stored in an `ndarray`. These warnings apply similarly to
    `Series` since it internally leverages `ndarray`.

    Parameters
    ----------
    arg : scalar, list, tuple, 1-d array, or Series
        Argument to be converted.
    errors : {'ignore', 'raise', 'coerce'}, default 'raise'
        - If 'raise', then invalid parsing will raise an exception.
        - If 'coerce', then invalid parsing will be set as NaN.
        - If 'ignore', then invalid parsing will return the input.
    downcast : str, default None
        Can be 'integer', 'signed', 'unsigned', or 'float'.
        If not None, and if the data has been successfully cast to a
        numerical dtype (or if the data was numeric to begin with),
        downcast that resulting data to the smallest numerical dtype
        possible according to the following rules:

        - 'integer' or 'signed': smallest signed int dtype (min.: np.int8)
        - 'unsigned': smallest unsigned int dtype (min.: np.uint8)
        - 'float': smallest float dtype (min.: np.float32)

        As this behaviour is separate from the core conversion to
        numeric values, any errors raised during the downcasting
        will be surfaced regardless of the value of the 'errors' input.

        In addition, downcasting will only occur if the size
        of the resulting data's dtype is strictly larger than
        the dtype it is to be cast to, so if none of the dtypes
        checked satisfy that specification, no downcasting will be
        performed on the data.

    Returns
    -------
    ret
        Numeric if parsing succeeded.
        Return type depends on input.  Series if Series, otherwise ndarray.

    See Also
    --------
    DataFrame.astype : Cast argument to a specified dtype.
    to_datetime : Convert argument to datetime.
    to_timedelta : Convert argument to timedelta.
    numpy.ndarray.astype : Cast a numpy array to a specified type.
    DataFrame.convert_dtypes : Convert dtypes.

    Examples
    --------
    Take separate series and convert to numeric, coercing when told to

    >>> s = pd.Series(['1.0', '2', -3])
    >>> pd.to_numeric(s)
    0    1.0
    1    2.0
    2   -3.0
    dtype: float64
    >>> pd.to_numeric(s, downcast='float')
    0    1.0
    1    2.0
    2   -3.0
    dtype: float32
    >>> pd.to_numeric(s, downcast='signed')
    0    1
    1    2
    2   -3
    dtype: int8
    >>> s = pd.Series(['apple', '1.0', '2', -3])
    >>> pd.to_numeric(s, errors='ignore')
    0    apple
    1      1.0
    2        2
    3       -3
    dtype: object
    >>> pd.to_numeric(s, errors='coerce')
    0    NaN
    1    1.0
    2    2.0
    3   -3.0
    dtype: float64

    Downcasting of nullable integer and floating dtypes is supported:

    >>> s = pd.Series([1, 2, 3], dtype="Int64")
    >>> pd.to_numeric(s, downcast="integer")
    0    1
    1    2
    2    3
    dtype: Int8
    >>> s = pd.Series([1.0, 2.1, 3.0], dtype="Float64")
    >>> pd.to_numeric(s, downcast="float")
    0    1.0
    1    2.1
    2    3.0
    dtype: Float32

# Aggregating data

In [77]:
#Daata types:Series, data frame (consist on series) or panel

df["EDUCH"].value_counts()

#2 observations for twin with 8 years of schooling

12    65
16    33
14    22
13    22
15    15
18    11
20     5
19     2
17     2
8      2
10     2
9      1
11     1
Name: EDUCH, dtype: int64

In [78]:
#for sorting
df["EDUCH"].value_counts().sort_index()

8      2
9      1
10     2
11     1
12    65
13    22
14    22
15    15
16    33
17     2
18    11
19     2
20     5
Name: EDUCH, dtype: int64

In [80]:
##Cross tabulation
#takes two series of same dimension (length)
pd.crosstab(df["WHITEH"],df["WHITEL"])
#most twins are both white, only 3 of different skin color
#can be saved for LaTeX

WHITEL   0    1
WHITEH
0       10    2
1        1  170

#Manipulation

In [81]:
#drop columns or rows
#df=df.drop(index[1,2,16]) #names of the rows
#df= df.drop('AGESQ', axis=1)

#ADD column:
#df["AGESQ"] = df["AGE"]**2 #(1) Give one value

In [82]:
#Sort
#df =df.sort_values(by='HRWAGEH') #sort by column
#df = df[sort(df-columns)] #re order columns alphabetically. All not specified columns are dropped

In [84]:
#Combine
df["combined"]=df["WHITEH"]+df["WHITEL"]

In [86]:
#Missing data
df["LHRWAGEH"].fillna(0) #fill with zeros where there has been NaN before

0      2.420368
1      0.000000
2      2.890372
3      2.803360
4      2.263366
         ...
178    3.025594
179    0.000000
180    1.704748
181    2.014903
182    2.197225
Name: LHRWAGEH, Length: 183, dtype: float64

In [89]:
#Drop observations containing missings
df.dropna(subset=["DLHRWAGE"])
df.shape

(183, 17)

# Grouping | Summary statistics

In [92]:
#Different dataframes for different years of schooling
#List of columns from which I want to group
grouped = df.groupby(["MALEH"])
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [96]:
grouped["AGE"].mean() #Age means of Male

MALEH
0    37.991081
1    39.364721
Name: AGE, dtype: float64

In [98]:
grouped["AGE"].agg(["mean","std"])
#Values by group.

            mean        std
MALEH
0      37.991081  12.467376
1      39.364721  13.853903

In [101]:
#One could give multiple columns too
grouped[["AGE","EDUCH"]].agg(["mean","std"])

             AGE                 EDUCH
            mean        std       mean       std
MALEH
0      37.991081  12.467376  13.848485  2.344614
1      39.364721  13.853903  14.071429  2.327343

# Wide vs Long

In [103]:
#For regressions and graphs long is more convenient
#PAndas use wide better
# A wide format contains values that do not repeat in the first column. A long format contains values that do repeat in the first column. 
# Long: tons of rows
# Wide: tons of columns
df.head()

#tidy long= only one column

,DLHRWAGE,DEDUC1,AGE,AGESQ,LHRWAGEH,WHITEH,MALEH,EDUCH,LHRWAGEL,WHITEL,MALEL,EDUCL,DEDUC2,DTEN,DMARRIED,DUNCOV,combined
0,0.259347,0,20.000000,1105.642156,2.420368,1,0,16,2.161022,1,0,16,0,1.333,0,0.0,2
1,NaN,-1,54.053388,2921.768764,NaN,1,0,9,2.060514,1,0,10,1,8.000,1,0.0,2
2,0.721318,7,43.570157,1898.358618,2.890372,1,0,19,2.169054,1,0,12,4,3.000,-1,0.0,2
3,0.011582,0,30.967830,959.006511,2.803360,1,1,12,2.791778,1,1,12,0,-2.000,0,1.0,2
4,-0.560985,0,34.633812,1199.500965,2.263366,1,1,14,2.824351,1,1,14,1,2.917,0,-1.0,2

In [104]:
#from wide to long: melt: 4 importan variabes (id_vars, value_vars, value_name[column])
df["id"] = df.index

In [110]:
id_vars=["id","WHITEH","MALEH","EDUCH","WHITEL","MALEL","EDUCL"]

value_vars = ["LHRWAGEL", "LHRWAGEH"]
melted = df.melt(id_vars=id_vars, value_vars=value_vars).dropna()
melted.head()
#the non specified columns are getting used in the column "variable"

   id  WHITEH  MALEH  EDUCH  WHITEL  MALEL  EDUCL  variable     value
0   0       1      0     16       1      0     16  LHRWAGEL  2.161022
1   1       1      0      9       1      0     10  LHRWAGEL  2.060514
2   2       1      0     19       1      0     12  LHRWAGEL  2.169054
3   3       1      1     12       1      1     12  LHRWAGEL  2.791778
4   4       1      1     14       1      1     14  LHRWAGEL  2.824351

In [116]:
import seaborn as sns

sns.relplot(data=melted, x="EDUCH",y="value", col="variable", row="MALEH")
#For each possible value in "variable" gets a different plots.
#now with only 2 diffferent values.
#Education of age twin in relation to income, wheter its male or not male

In [123]:
#Long to wide? --> Pivot
pivoted=melted.pivot(index=id_vars, columns="variable", values="value")

In [124]:
#reset idex
pivoted.reset_index()
#fewer columns becuase first melt used less columns

variable   id  WHITEH  MALEH  EDUCH  WHITEL  MALEL  EDUCL  LHRWAGEH  LHRWAGEL
0           0       1      0     16       1      0     16  2.420368  2.161022
1           1       1      0      9       1      0     10       NaN  2.060514
2           2       1      0     19       1      0     12  2.890372  2.169054
3           3       1      1     12       1      1     12  2.803360  2.791778
4           4       1      1     14       1      1     14  2.263366  2.824351
..        ...     ...    ...    ...     ...    ...    ...       ...       ...
169       178       1      0     12       1      0     12  3.025594  2.915690
170       179       1      1     16       1      1     16       NaN  2.978077
171       180       1      0     14       1      0     12  1.704748  0.854415
172       181       1      0     14       1      0     16  2.014903  2.744418
173       182       1      0     16       1      0     16  2.197225  2.698000

[174 rows x 9 columns]